Revit 2027 API
FabricationService.GetButtonCount Method
 Gets the number of buttons for a given palette in the service.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetButtonCount(
	int palette
)
Public Function GetButtonCount (
	palette As Integer
) As Integer
public:
int GetButtonCount(
	int palette
)
member GetButtonCount :
        palette : int -> int
Parameters
palette Int32
 The index of the palette
Return Value
Int32
 The number of buttons.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The index palette is not larger or equal to 0 and less than PaletteCount.
See Also
Reference
FabricationService Class
Autodesk.Revit.DB Namespace